Revit 2027 API
BuiltInFailures.SteelElementFailures.SteelElementModifyRangesTaskNotFinished Property
 Cannot modify ranges while background calculations are in progress.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SteelElementModifyRangesTaskNotFinished { get; }
Public Shared ReadOnly Property SteelElementModifyRangesTaskNotFinished As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SteelElementModifyRangesTaskNotFinished {
	FailureDefinitionId^ get ();
}
static member SteelElementModifyRangesTaskNotFinished : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SteelElementFailures Class
Autodesk.Revit.DB Namespace